# Errors
ntf-error-unknown-state = <i>⚠️ Ошибка: неизвестное состояние. Диалог перезапущен!</i>
ntf-error-connect-remnawave = <i>⚠️ Ошибка: не удалось подключиться к Remnawave!</i>


# Events
ntf-event-bot-startup =
    #EventBotStarted

    <b>🔅 Событие: Бот запущен!</b>

    Режим обслуживания: { $mode ->
        [global] включен (глобальный)
        [purchase] включен (платежи)
        *[off] выключен
    }

ntf-event-bot-shutdown =
    #EventBotShutdown

    <b>🔅 Событие: Бот остановлен!</b>

ntf-event-new-user =
    #EventNewUser

    <b>🔅 Событие: Новый пользователь!</b>

    <blockquote>
    • ID: {$id}
    • Имя: {$name}
    </blockquote>

# Notifications
ntf-user-block-self = <i>❌ Нельзя заблокировать самого себя</i>
ntf-user-switch-role-self = <i>❌ Нельзя сменить роль самому себе</i>

ntf-user-block-dev =
    ⚠️ Разработчик { $id } ({ $name }) попытался вас заблокировать!

    <i>Он был разжалован и заблокирован</i>

ntf-user-switch-role-dev =
    ⚠️ Разработчик { $id } ({ $name }) попытался сменить вам роль!

    <i>Он был разжалован и заблокирован</i>

ntf-maintenance-denied-global = <i>🚧 Бот в режиме обслуживания, попробуйте позже</i>
ntf-maintenance-denied-purchase= <i>🚧 Бот в режиме обслуживания, Вам придет уведомление когда бот снова будет доступен</i>